Ran Plan for dir: `aws/dev/vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
00:01:00.830 STDOUT terraform: data.aws_availability_zones.available: Reading...
00:01:01.178 STDOUT terraform: data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
00:01:01.430 STDOUT terraform: Terraform used the selected providers to generate the following execution
00:01:01.430 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
00:01:01.430 STDOUT terraform:   + create
00:01:01.430 STDOUT terraform: Terraform will perform the following actions:
00:01:01.430 STDOUT terraform:   # module.vpc.aws_default_network_acl.this[0] will be created
00:01:01.430 STDOUT terraform:   + resource "aws_default_network_acl" "this" {
00:01:01.430 STDOUT terraform:       + arn                    = (known after apply)
00:01:01.430 STDOUT terraform:       + default_network_acl_id = (known after apply)
00:01:01.430 STDOUT terraform:       + id                     = (known after apply)
00:01:01.430 STDOUT terraform:       + owner_id               = (known after apply)
00:01:01.430 STDOUT terraform:       + tags                   = {
00:01:01.430 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.430 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:       + tags_all               = {
00:01:01.431 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.431 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:       + vpc_id                 = (known after apply)
00:01:01.431 STDOUT terraform:       + egress {
00:01:01.431 STDOUT terraform:           + action          = "allow"
00:01:01.431 STDOUT terraform:           + from_port       = 0
00:01:01.431 STDOUT terraform:           + ipv6_cidr_block = "::/0"
00:01:01.431 STDOUT terraform:           + protocol        = "-1"
00:01:01.431 STDOUT terraform:           + rule_no         = 101
00:01:01.431 STDOUT terraform:           + to_port         = 0
00:01:01.431 STDOUT terraform:             # (1 unchanged attribute hidden)
00:01:01.431 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:       + egress {
00:01:01.431 STDOUT terraform:           + action          = "allow"
00:01:01.431 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
00:01:01.431 STDOUT terraform:           + from_port       = 0
00:01:01.431 STDOUT terraform:           + protocol        = "-1"
00:01:01.431 STDOUT terraform:           + rule_no         = 100
00:01:01.431 STDOUT terraform:           + to_port         = 0
00:01:01.431 STDOUT terraform:             # (1 unchanged attribute hidden)
00:01:01.431 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:       + ingress {
00:01:01.431 STDOUT terraform:           + action          = "allow"
00:01:01.431 STDOUT terraform:           + from_port       = 0
00:01:01.431 STDOUT terraform:           + ipv6_cidr_block = "::/0"
00:01:01.431 STDOUT terraform:           + protocol        = "-1"
00:01:01.431 STDOUT terraform:           + rule_no         = 101
00:01:01.431 STDOUT terraform:           + to_port         = 0
00:01:01.431 STDOUT terraform:             # (1 unchanged attribute hidden)
00:01:01.431 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:       + ingress {
00:01:01.431 STDOUT terraform:           + action          = "allow"
00:01:01.431 STDOUT terraform:           + cidr_block      = "0.0.0.0/0"
00:01:01.431 STDOUT terraform:           + from_port       = 0
00:01:01.431 STDOUT terraform:           + protocol        = "-1"
00:01:01.431 STDOUT terraform:           + rule_no         = 100
00:01:01.431 STDOUT terraform:           + to_port         = 0
00:01:01.431 STDOUT terraform:             # (1 unchanged attribute hidden)
00:01:01.431 STDOUT terraform:         }
00:01:01.431 STDOUT terraform:     }
00:01:01.431 STDOUT terraform:   # module.vpc.aws_default_route_table.default[0] will be created
00:01:01.431 STDOUT terraform:   + resource "aws_default_route_table" "default" {
00:01:01.431 STDOUT terraform:       + arn                    = (known after apply)
00:01:01.431 STDOUT terraform:       + default_route_table_id = (known after apply)
00:01:01.431 STDOUT terraform:       + id                     = (known after apply)
00:01:01.432 STDOUT terraform:       + owner_id               = (known after apply)
00:01:01.432 STDOUT terraform:       + route                  = (known after apply)
00:01:01.432 STDOUT terraform:       + tags                   = {
00:01:01.432 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.432 STDOUT terraform:         }
00:01:01.432 STDOUT terraform:       + tags_all               = {
00:01:01.432 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.432 STDOUT terraform:         }
00:01:01.432 STDOUT terraform:       + vpc_id                 = (known after apply)
00:01:01.432 STDOUT terraform:       + timeouts {
00:01:01.432 STDOUT terraform:           + create = "5m"
00:01:01.432 STDOUT terraform:           + update = "5m"
00:01:01.432 STDOUT terraform:         }
00:01:01.432 STDOUT terraform:     }
00:01:01.432 STDOUT terraform:   # module.vpc.aws_default_security_group.this[0] will be created
00:01:01.432 STDOUT terraform:   + resource "aws_default_security_group" "this" {
00:01:01.432 STDOUT terraform:       + arn                    = (known after apply)
00:01:01.432 STDOUT terraform:       + description            = (known after apply)
00:01:01.432 STDOUT terraform:       + egress                 = (known after apply)
00:01:01.432 STDOUT terraform:       + id                     = (known after apply)
00:01:01.432 STDOUT terraform:       + ingress                = (known after apply)
00:01:01.432 STDOUT terraform:       + name                   = (known after apply)
00:01:01.432 STDOUT terraform:       + name_prefix            = (known after apply)
00:01:01.432 STDOUT terraform:       + owner_id               = (known after apply)
00:01:01.432 STDOUT terraform:       + revoke_rules_on_delete = false
00:01:01.432 STDOUT terraform:       + tags                   = {
00:01:01.432 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.432 STDOUT terraform:         }
00:01:01.432 STDOUT terraform:       + tags_all               = {
00:01:01.432 STDOUT terraform:           + "Name" = "dev-vpc-default"
00:01:01.433 STDOUT terraform:         }
00:01:01.433 STDOUT terraform:       + vpc_id                 = (known after apply)
00:01:01.433 STDOUT terraform:     }
00:01:01.433 STDOUT terraform:   # module.vpc.aws_eip.nat[0] will be created
00:01:01.435 STDOUT terraform:   + resource "aws_eip" "nat" {
00:01:01.435 STDOUT terraform:       + allocation_id        = (known after apply)
00:01:01.435 STDOUT terraform:       + arn                  = (known after apply)
00:01:01.435 STDOUT terraform:       + association_id       = (known after apply)
00:01:01.435 STDOUT terraform:       + carrier_ip           = (known after apply)
00:01:01.435 STDOUT terraform:       + customer_owned_ip    = (known after apply)
00:01:01.435 STDOUT terraform:       + domain               = "vpc"
00:01:01.435 STDOUT terraform:       + id                   = (known after apply)
00:01:01.435 STDOUT terraform:       + instance             = (known after apply)
00:01:01.435 STDOUT terraform:       + network_border_group = (known after apply)
00:01:01.435 STDOUT terraform:       + network_interface    = (known after apply)
00:01:01.435 STDOUT terraform:       + private_dns          = (known after apply)
00:01:01.435 STDOUT terraform:       + private_ip           = (known after apply)
00:01:01.436 STDOUT terraform:       + ptr_record           = (known after apply)
00:01:01.436 STDOUT terraform:       + public_dns           = (known after apply)
00:01:01.436 STDOUT terraform:       + public_ip            = (known after apply)
00:01:01.436 STDOUT terraform:       + public_ipv4_pool     = (known after apply)
00:01:01.436 STDOUT terraform:       + tags                 = {
00:01:01.436 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
00:01:01.436 STDOUT terraform:         }
00:01:01.436 STDOUT terraform:       + tags_all             = {
00:01:01.436 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
00:01:01.436 STDOUT terraform:         }
00:01:01.436 STDOUT terraform:       + vpc                  = (known after apply)
00:01:01.436 STDOUT terraform:     }
00:01:01.436 STDOUT terraform:   # module.vpc.aws_internet_gateway.this[0] will be created
00:01:01.436 STDOUT terraform:   + resource "aws_internet_gateway" "this" {
00:01:01.436 STDOUT terraform:       + arn      = (known after apply)
00:01:01.436 STDOUT terraform:       + id       = (known after apply)
00:01:01.436 STDOUT terraform:       + owner_id = (known after apply)
00:01:01.436 STDOUT terraform:       + tags     = {
00:01:01.436 STDOUT terraform:           + "Name" = "dev-vpc"
00:01:01.436 STDOUT terraform:         }
00:01:01.436 STDOUT terraform:       + tags_all = {
00:01:01.436 STDOUT terraform:           + "Name" = "dev-vpc"
00:01:01.436 STDOUT terraform:         }
00:01:01.436 STDOUT terraform:       + vpc_id   = (known after apply)
00:01:01.436 STDOUT terraform:     }
00:01:01.436 STDOUT terraform:   # module.vpc.aws_nat_gateway.this[0] will be created
00:01:01.436 STDOUT terraform:   + resource "aws_nat_gateway" "this" {
00:01:01.436 STDOUT terraform:       + allocation_id                      = (known after apply)
00:01:01.436 STDOUT terraform:       + association_id                     = (known after apply)
00:01:01.436 STDOUT terraform:       + connectivity_type                  = "public"
00:01:01.436 STDOUT terraform:       + id                                 = (known after apply)
00:01:01.436 STDOUT terraform:       + network_interface_id               = (known after apply)
00:01:01.436 STDOUT terraform:       + private_ip                         = (known after apply)
00:01:01.436 STDOUT terraform:       + public_ip                          = (known after apply)
00:01:01.436 STDOUT terraform:       + secondary_private_ip_address_count = (known after apply)
00:01:01.436 STDOUT terraform:       + secondary_private_ip_addresses     = (known after apply)
00:01:01.436 STDOUT terraform:       + subnet_id                          = (known after apply)
00:01:01.436 STDOUT terraform:       + tags                               = {
00:01:01.436 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
00:01:01.436 STDOUT terraform:         }
00:01:01.437 STDOUT terraform:       + tags_all                           = {
00:01:01.437 STDOUT terraform:           + "Name" = "dev-vpc-eu-west-1a"
00:01:01.437 STDOUT terraform:         }
00:01:01.437 STDOUT terraform:     }
00:01:01.437 STDOUT terraform:   # module.vpc.aws_route.private_nat_gateway[0] will be created
00:01:01.437 STDOUT terraform:   + resource "aws_route" "private_nat_gateway" {
00:01:01.437 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
00:01:01.437 STDOUT terraform:       + id                     = (known after apply)
00:01:01.437 STDOUT terraform:       + instance_id            = (known after apply)
00:01:01.437 STDOUT terraform:       + instance_owner_id      = (known after apply)
00:01:01.437 STDOUT terraform:       + nat_gateway_id         = (known after apply)
00:01:01.437 STDOUT terraform:       + network_interface_id   = (known after apply)
00:01:01.437 STDOUT terraform:       + origin                 = (known after apply)
00:01:01.437 STDOUT terraform:       + route_table_id         = (known after apply)
00:01:01.437 STDOUT terraform:       + state                  = (known after apply)
00:01:01.437 STDOUT terraform:       + timeouts {
00:01:01.437 STDOUT terraform:           + create = "5m"
00:01:01.437 STDOUT terraform:         }
00:01:01.437 STDOUT terraform:     }
00:01:01.437 STDOUT terraform:   # module.vpc.aws_route.public_internet_gateway[0] will be created
00:01:01.437 STDOUT terraform:   + resource "aws_route" "public_internet_gateway" {
00:01:01.437 STDOUT terraform:       + destination_cidr_block = "0.0.0.0/0"
00:01:01.437 STDOUT terraform:       + gateway_id             = (known after apply)
00:01:01.437 STDOUT terraform:       + id                     = (known after apply)
00:01:01.437 STDOUT terraform:       + instance_id            = (known after apply)
00:01:01.437 STDOUT terraform:       + instance_owner_id      = (known after apply)
00:01:01.437 STDOUT terraform:       + network_interface_id   = (known after apply)
00:01:01.437 STDOUT terraform:       + origin                 = (known after apply)
00:01:01.437 STDOUT terraform:       + route_table_id         = (known after apply)
00:01:01.437 STDOUT terraform:       + state                  = (known after apply)
00:01:01.437 STDOUT terraform:       + timeouts {
00:01:01.437 STDOUT terraform:           + create = "5m"
00:01:01.437 STDOUT terraform:         }
00:01:01.437 STDOUT terraform:     }
00:01:01.437 STDOUT terraform:   # module.vpc.aws_route_table.private[0] will be created
00:01:01.437 STDOUT terraform:   + resource "aws_route_table" "private" {
00:01:01.437 STDOUT terraform:       + arn              = (known after apply)
00:01:01.437 STDOUT terraform:       + id               = (known after apply)
00:01:01.437 STDOUT terraform:       + owner_id         = (known after apply)
00:01:01.438 STDOUT terraform:       + propagating_vgws = (known after apply)
00:01:01.438 STDOUT terraform:       + route            = (known after apply)
00:01:01.438 STDOUT terraform:       + tags             = {
00:01:01.438 STDOUT terraform:           + "Name" = "dev-vpc-private"
00:01:01.438 STDOUT terraform:         }
00:01:01.438 STDOUT terraform:       + tags_all         = {
00:01:01.438 STDOUT terraform:           + "Name" = "dev-vpc-private"
00:01:01.438 STDOUT terraform:         }
00:01:01.438 STDOUT terraform:       + vpc_id           = (known after apply)
00:01:01.438 STDOUT terraform:     }
00:01:01.438 STDOUT terraform:   # module.vpc.aws_route_table.public[0] will be created
00:01:01.438 STDOUT terraform:   + resource "aws_route_table" "public" {
00:01:01.438 STDOUT terraform:       + arn              = (known after apply)
00:01:01.438 STDOUT terraform:       + id               = (known after apply)
00:01:01.438 STDOUT terraform:       + owner_id         = (known after apply)
00:01:01.438 STDOUT terraform:       + propagating_vgws = (known after apply)
00:01:01.438 STDOUT terraform:       + route            = (known after apply)
00:01:01.438 STDOUT terraform:       + tags             = {
00:01:01.438 STDOUT terraform:           + "Name" = "dev-vpc-public"
00:01:01.438 STDOUT terraform:         }
00:01:01.438 STDOUT terraform:       + tags_all         = {
00:01:01.438 STDOUT terraform:           + "Name" = "dev-vpc-public"
00:01:01.438 STDOUT terraform:         }
00:01:01.438 STDOUT terraform:       + vpc_id           = (known after apply)
00:01:01.438 STDOUT terraform:     }
00:01:01.438 STDOUT terraform:   # module.vpc.aws_route_table_association.private[0] will be created
00:01:01.438 STDOUT terraform:   + resource "aws_route_table_association" "private" {
00:01:01.438 STDOUT terraform:       + id             = (known after apply)
00:01:01.438 STDOUT terraform:       + route_table_id = (known after apply)
00:01:01.438 STDOUT terraform:       + subnet_id      = (known after apply)
00:01:01.438 STDOUT terraform:     }
00:01:01.438 STDOUT terraform:   # module.vpc.aws_route_table_association.private[1] will be created
00:01:01.438 STDOUT terraform:   + resource "aws_route_table_association" "private" {
00:01:01.438 STDOUT terraform:       + id             = (known after apply)
00:01:01.438 STDOUT terraform:       + route_table_id = (known after apply)
00:01:01.438 STDOUT terraform:       + subnet_id      = (known after apply)
00:01:01.438 STDOUT terraform:     }
00:01:01.438 STDOUT terraform:   # module.vpc.aws_route_table_association.public[0] will be created
00:01:01.438 STDOUT terraform:   + resource "aws_route_table_association" "public" {
00:01:01.438 STDOUT terraform:       + id             = (known after apply)
00:01:01.438 STDOUT terraform:       + route_table_id = (known after apply)
00:01:01.439 STDOUT terraform:       + subnet_id      = (known after apply)
00:01:01.439 STDOUT terraform:     }
00:01:01.439 STDOUT terraform:   # module.vpc.aws_route_table_association.public[1] will be created
00:01:01.439 STDOUT terraform:   + resource "aws_route_table_association" "public" {
00:01:01.439 STDOUT terraform:       + id             = (known after apply)
00:01:01.439 STDOUT terraform:       + route_table_id = (known after apply)
00:01:01.439 STDOUT terraform:       + subnet_id      = (known after apply)
00:01:01.439 STDOUT terraform:     }
00:01:01.439 STDOUT terraform:   # module.vpc.aws_subnet.private[0] will be created
00:01:01.439 STDOUT terraform:   + resource "aws_subnet" "private" {
00:01:01.439 STDOUT terraform:       + arn                                            = (known after apply)
00:01:01.439 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
00:01:01.439 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
00:01:01.439 STDOUT terraform:       + availability_zone_id                           = (known after apply)
00:01:01.439 STDOUT terraform:       + cidr_block                                     = "10.0.1.0/24"
00:01:01.439 STDOUT terraform:       + enable_dns64                                   = false
00:01:01.439 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
00:01:01.439 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
00:01:01.439 STDOUT terraform:       + id                                             = (known after apply)
00:01:01.439 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
00:01:01.439 STDOUT terraform:       + ipv6_native                                    = false
00:01:01.439 STDOUT terraform:       + map_public_ip_on_launch                        = false
00:01:01.439 STDOUT terraform:       + owner_id                                       = (known after apply)
00:01:01.439 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
00:01:01.439 STDOUT terraform:       + tags                                           = {
00:01:01.439 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
00:01:01.439 STDOUT terraform:         }
00:01:01.439 STDOUT terraform:       + tags_all                                       = {
00:01:01.439 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1a"
00:01:01.439 STDOUT terraform:         }
00:01:01.439 STDOUT terraform:       + vpc_id                                         = (known after apply)
00:01:01.439 STDOUT terraform:     }
00:01:01.439 STDOUT terraform:   # module.vpc.aws_subnet.private[1] will be created
00:01:01.439 STDOUT terraform:   + resource "aws_subnet" "private" {
00:01:01.440 STDOUT terraform:       + arn                                            = (known after apply)
00:01:01.440 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
00:01:01.440 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
00:01:01.440 STDOUT terraform:       + availability_zone_id                           = (known after apply)
00:01:01.440 STDOUT terraform:       + cidr_block                                     = "10.0.2.0/24"
00:01:01.440 STDOUT terraform:       + enable_dns64                                   = false
00:01:01.440 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
00:01:01.440 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
00:01:01.440 STDOUT terraform:       + id                                             = (known after apply)
00:01:01.440 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
00:01:01.440 STDOUT terraform:       + ipv6_native                                    = false
00:01:01.440 STDOUT terraform:       + map_public_ip_on_launch                        = false
00:01:01.440 STDOUT terraform:       + owner_id                                       = (known after apply)
00:01:01.440 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
00:01:01.440 STDOUT terraform:       + tags                                           = {
00:01:01.440 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
00:01:01.440 STDOUT terraform:         }
00:01:01.440 STDOUT terraform:       + tags_all                                       = {
00:01:01.440 STDOUT terraform:           + "Name" = "dev-vpc-private-eu-west-1b"
00:01:01.440 STDOUT terraform:         }
00:01:01.440 STDOUT terraform:       + vpc_id                                         = (known after apply)
00:01:01.440 STDOUT terraform:     }
00:01:01.440 STDOUT terraform:   # module.vpc.aws_subnet.public[0] will be created
00:01:01.440 STDOUT terraform:   + resource "aws_subnet" "public" {
00:01:01.440 STDOUT terraform:       + arn                                            = (known after apply)
00:01:01.440 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
00:01:01.440 STDOUT terraform:       + availability_zone                              = "eu-west-1a"
00:01:01.440 STDOUT terraform:       + availability_zone_id                           = (known after apply)
00:01:01.440 STDOUT terraform:       + cidr_block                                     = "10.0.101.0/24"
00:01:01.440 STDOUT terraform:       + enable_dns64                                   = false
00:01:01.440 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
00:01:01.441 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
00:01:01.441 STDOUT terraform:       + id                                             = (known after apply)
00:01:01.441 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
00:01:01.441 STDOUT terraform:       + ipv6_native                                    = false
00:01:01.441 STDOUT terraform:       + map_public_ip_on_launch                        = false
00:01:01.441 STDOUT terraform:       + owner_id                                       = (known after apply)
00:01:01.441 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
00:01:01.441 STDOUT terraform:       + tags                                           = {
00:01:01.441 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
00:01:01.441 STDOUT terraform:         }
00:01:01.441 STDOUT terraform:       + tags_all                                       = {
00:01:01.441 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1a"
00:01:01.441 STDOUT terraform:         }
00:01:01.441 STDOUT terraform:       + vpc_id                                         = (known after apply)
00:01:01.441 STDOUT terraform:     }
00:01:01.441 STDOUT terraform:   # module.vpc.aws_subnet.public[1] will be created
00:01:01.441 STDOUT terraform:   + resource "aws_subnet" "public" {
00:01:01.441 STDOUT terraform:       + arn                                            = (known after apply)
00:01:01.441 STDOUT terraform:       + assign_ipv6_address_on_creation                = false
00:01:01.441 STDOUT terraform:       + availability_zone                              = "eu-west-1b"
00:01:01.441 STDOUT terraform:       + availability_zone_id                           = (known after apply)
00:01:01.441 STDOUT terraform:       + cidr_block                                     = "10.0.102.0/24"
00:01:01.441 STDOUT terraform:       + enable_dns64                                   = false
00:01:01.441 STDOUT terraform:       + enable_resource_name_dns_a_record_on_launch    = false
00:01:01.441 STDOUT terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
00:01:01.441 STDOUT terraform:       + id                                             = (known after apply)
00:01:01.441 STDOUT terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
00:01:01.441 STDOUT terraform:       + ipv6_native                                    = false
00:01:01.441 STDOUT terraform:       + map_public_ip_on_launch                        = false
00:01:01.441 STDOUT terraform:       + owner_id                                       = (known after apply)
00:01:01.441 STDOUT terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
00:01:01.441 STDOUT terraform:       + tags                                           = {
00:01:01.442 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
00:01:01.442 STDOUT terraform:         }
00:01:01.442 STDOUT terraform:       + tags_all                                       = {
00:01:01.442 STDOUT terraform:           + "Name" = "dev-vpc-public-eu-west-1b"
00:01:01.442 STDOUT terraform:         }
00:01:01.442 STDOUT terraform:       + vpc_id                                         = (known after apply)
00:01:01.442 STDOUT terraform:     }
00:01:01.442 STDOUT terraform:   # module.vpc.aws_vpc.this[0] will be created
00:01:01.442 STDOUT terraform:   + resource "aws_vpc" "this" {
00:01:01.442 STDOUT terraform:       + arn                                  = (known after apply)
00:01:01.442 STDOUT terraform:       + cidr_block                           = "10.0.0.0/16"
00:01:01.442 STDOUT terraform:       + default_network_acl_id               = (known after apply)
00:01:01.442 STDOUT terraform:       + default_route_table_id               = (known after apply)
00:01:01.442 STDOUT terraform:       + default_security_group_id            = (known after apply)
00:01:01.442 STDOUT terraform:       + dhcp_options_id                      = (known after apply)
00:01:01.442 STDOUT terraform:       + enable_dns_hostnames                 = true
00:01:01.442 STDOUT terraform:       + enable_dns_support                   = true
00:01:01.442 STDOUT terraform:       + enable_network_address_usage_metrics = (known after apply)
00:01:01.442 STDOUT terraform:       + id                                   = (known after apply)
00:01:01.442 STDOUT terraform:       + instance_tenancy                     = "default"
00:01:01.442 STDOUT terraform:       + ipv6_association_id                  = (known after apply)
00:01:01.442 STDOUT terraform:       + ipv6_cidr_block                      = (known after apply)
00:01:01.442 STDOUT terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
00:01:01.442 STDOUT terraform:       + main_route_table_id                  = (known after apply)
00:01:01.442 STDOUT terraform:       + owner_id                             = (known after apply)
00:01:01.442 STDOUT terraform:       + tags                                 = {
00:01:01.442 STDOUT terraform:           + "Name" = "dev-vpc"
00:01:01.442 STDOUT terraform:         }
00:01:01.442 STDOUT terraform:       + tags_all                             = {
00:01:01.442 STDOUT terraform:           + "Name" = "dev-vpc"
00:01:01.442 STDOUT terraform:         }
00:01:01.442 STDOUT terraform:     }
00:01:01.442 STDOUT terraform: Plan: 19 to add, 0 to change, 0 to destroy.
00:01:01.442 STDOUT terraform: Changes to Outputs:
00:01:01.442 STDOUT terraform:   + private_subnets = [
00:01:01.442 STDOUT terraform:       + (known after apply),
00:01:01.442 STDOUT terraform:       + (known after apply),
00:01:01.442 STDOUT terraform:     ]
00:01:01.442 STDOUT terraform:   + public_subnets  = [
00:01:01.442 STDOUT terraform:       + (known after apply),
00:01:01.442 STDOUT terraform:       + (known after apply),
00:01:01.442 STDOUT terraform:     ]
00:01:01.443 STDOUT terraform:   + vpc_id          = (known after apply)
00:01:01.443 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
00:01:01.443 STDOUT terraform: Saved the plan to:
00:01:01.443 STDOUT terraform: ./default.tfplan
00:01:01.443 STDOUT terraform: To perform exactly these actions, run the following command to apply:
00:01:01.443 STDOUT terraform:     terraform apply "./default.tfplan"

00:01:04.766 INFO   Retrieved output from terraform
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d aws/dev/vpc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://3.88.206.158:4141/lock?id=ahmedbadawy4%252Fterraform-infrastructure%252Faws%252Fdev%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d aws/dev/vpc
  ```
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```